;; NMEAモニタ設定ファイル

[ComPort]
;RS232Cの入力ポートとボーレート、自動再接続
Port1=
Baud1=4800
ReConnect=1

[TCP]
;TCPクライアント
Host=

[DataOutput]
;RS232Cの出力ポートとボーレート、TCPサーバー
ComOut=0

[LocalTime]
;ローカルタイムの時差と略称
Offset=
Name=JST
AutoOffs=1
AutoName=1

[TimeErrLogging]
;NMEAログに時刻誤差を含める条件
AddGPTXT=0

[GPSType]
;選択しているGPSタイプ
GPStype=Not Selected

[Option]
;オプション設定
;  天空図の目盛、チェックサムエラー無視、再オープン時間、
;  ヒント表示、軌跡１ピクセル、ddﾟmm.mm"形式の表示、原点の自動更新
;  ログファイル読込みフォルダ、ログファイル書込みフォルダ、キャプチャ・ディレイ(50mS単位)
;  RMCセンテンスのUTC時刻監視の時間差、言語モード、フォント指定
Version=Ver3.98
LinElev=1
SumIgnore=0
ReOpen=13
ShowHint=1
Track1pixel=0
DDMMM=0
AutoRC=1
ReadDir=
WriteDir=
CaptureDelay=8
UTCstepALM=0.5
EnglishMode=0
EngCharset=0
EngFontName=Tahoma
EngFontSize=8
JpCharset=128
JpFontName=Tahoma
JpFontSize=8
DegChar=°

[V4.1Status]
NavStatus=S:Safe,C:Caution,U:Unsafe,V:Not valid
SystemID=1:GPS,2:GLONASS,3:Galileo,4:BeiDou,5:QZSS,6:NavIC
SignalIDGP=0:All,1:L1CA,2:L1PY,3:L1 M,4:L2PY,5:L2CM,6:L2CL,7:L5-I,8:L5-Q
SignalIDGL=0:All,1:G1CA,2:G1 P,3:G2CA,4:G2 P
SignalIDGA=0:All,1:E5a,2:E5b,3:E5ab,4:E6-A,5:E6BC,6:L1-A,7:L1BC
SignalIDQZ=0:All,1:L1CA,2:L1CD,3:L1CP,4:LIS,5:L2CM,6:L2CL,7:L5-I,8:L5-Q,9:L6D,A:L6E
SignalIDGI=0:All,1:L5SPS,2:SSPS,3:L5RS,4:S-RS,5:L1SPS
;NMEA 0183 Ver4.11
SignalIDBD=0:All,1:B1I,2:B1Q,3:B1C,4:B1A,5:B2-a,6:B2-b,7:B2ab,8:B3I,9:B3Q,A:B3A,B:B2I,C:B2Q
;NMEA 0183 Ver4.10
;SignalIDBD=0:All,1:B1I,2:B1Q,3:B2I,4:B2Q,5:B3I,6:B3Q

[Ext_Sen]
$PMTKCHN=1:SID/SNR/Status(2/2/1)|2:SID/SNR/Status(2/2/1)|3:SID/SNR/Status(2/2/1)|4:SID/SNR/Status(2/2/1)|5:SID/SNR/Status(2/2/1)|6:SID/SNR/Status(2/2/1)|7:SID/SNR/Status(2/2/1)|8:SID/SNR/Status(2/2/1)|9:SID/SNR/Status(2/2/1)|10:SID/SNR/Status(2/2/1)|11:SID/SNR/Status(2/2/1)|12:SID/SNR/Status(2/2/1)|13:SID/SNR/Status(2/2/1)|14:SID/SNR/Status(2/2/1)|15:SID/SNR/Status(2/2/1)|16:SID/SNR/Status(2/2/1)|17:SID/SNR/Status(2/2/1)|18:SID/SNR/Status(2/2/1)|19:SID/SNR/Status(2/2/1)|20:SID/SNR/Status(2/2/1)|21:SID/SNR/Status(2/2/1)|22:SID/SNR/Status(2/2/1)|23:SID/SNR/Status(2/2/1)|24:SID/SNR/Status(2/2/1)|25:SID/SNR/Status(2/2/1)|26:SID/SNR/Status(2/2/1)|27:SID/SNR/Status(2/2/1)|28:SID/SNR/Status(2/2/1)|29:SID/SNR/Status(2/2/1)|30:SID/SNR/Status(2/2/1)|31:SID/SNR/Status(2/2/1)|32:SID/SNR/Status(2/2/1)|;Status: 0=Idle 1=Searching 2=Tracking
$GPRMB=Data status|Cross track error|Direction to steer: L/R|Origin waypoint ID|Destination waypoint ID|Destination waypoint latitude.L,N/S|Destination waypoint longitude.L,E/W|Range to destination (nautical miles)|Bearing to destination (degrees True)|Destination closing velocity (knots)|Arrival status: A/V
$LCGLL=緯度.L, N/S|経度.L, E/W|時刻 (UTC).T|ステイタス|モード
$GPSEN=X*256g (Hex)|Y*256g (Hex)|Z*256g (Hex)
$GPTXT=メッセージ総数|メッセージ番号|メッセージの重要度|テキスト メッセージ|;重要度: 00=エラー 01=警告 02=注釈 07=ユーザー
$GNTXT=メッセージ総数|メッセージ番号|メッセージの重要度|テキスト メッセージ|;重要度: 00=エラー 01=警告 02=注釈 07=ユーザー

[NTRIPCasterTableURL]

[GpsData]
;GPSタイプとＳ/Ｎ比(最大値,最小値,スレシレベル)、開始センテンス(省略時：GPGGA)、
;NMEAセンテンスの判定（ 0:Auto, 1:GPS, 2:GPS+GLONASS ）、
;時刻同期の調整秒数(省略時：0.0秒)、除外センテンスのリスト
;<別名>=<実名> でエイリアス指定（データを共有する）。
Not Selected=65,0,0,,0,,
BT-Q1000=65,10,25,,0,,$PMTKCHN
BT-Q1000X=65,10,22,,0,,$PMTKCHN
BU-353=60,5,20,,0,0.64,
Gms-b6=65,10,22,GNGGA,0,0.9,$PMTKCHN
Gms-g6a=65,10,22,GPGGA,0,0.7,$PMTKCHN
Gms-g6=Gms-g6a
Gms-g9=Gms-g6a
GNS 2000=60,0,15,,0,0.8,$PMTKCHN
i-Blue747A+=65,10,22,,0,,$PMTKCHN
LEA-6T=65,0,20,GPRMC,0,,$GPTXT,$GPGBS,$GPGRS
LEA-M8F=65,0,20,GNRMC,0,,$GNTXT,$GNGRS,$GNGBS,$GPGBS,$GPGRS
LEA-M8T=65,0,20,GNRMC,0,,$GNTXT,$GNGRS,$GNGBS,$GPGBS,$GPGRS
M-1000=65,10,25,,0,0.69,$PMTKCHN
M-241=65,10,25,,0,,$PMTKCHN
M-241 Plus=65,10,25,GNGGA,0,,
NEO-M8N=65,0,20,GNRMC,0,,$GNTXT,$GNGRS,$GNGBS,$GPGBS,$GPGRS
NEO-M8T=65,0,20,GNRMC,0,,$GNTXT,$GNGRS,$GNGBS,$GPGBS,$GPGRS
SiRF(general)=60,0,0,,0,,
V-900=65,10,25,,0,,$PMTKCHN
VGPS-900=V-900
ZED-F9P=65,0,30,GNRMC,0,0.06,$GNTXT
Broadcom API=65,0,0,GPRMC,0,0.71,
NEO-D9C=65,0,30,GNRMC,0,,
P-7 Pro=60,5,0,,0,,

;機種ごとのGPSコマンド・リスト
;セミコロン以降はコメント
;複数のコマンドは「|」で分割する（コマンド間は約１秒を空ける）
;コマンド間の休止時間が足りない場合は「|」を追加（１個当たり約１秒）
;コマンド末尾が「*」ならチェックサムを付加しない

[GpsCmd SiRF(general)]
Cmd0=$PSRF104,0,0,0,0,1,1,12,4 ;コールドスタート
Cmd1=$PSRF104,0,0,0,0,1,1,12,2 ;ウォームスタート
Cmd2=$PSRF103,00,00,01,01  ;GGAを１秒間隔で出力
Cmd3=$PSRF103,00,00,00,01  ;GGA off
Cmd4=$PSRF103,01,00,01,01  ;GLLを１秒間隔で出力
Cmd5=$PSRF103,01,00,00,01  ;GLL off
Cmd6=$PSRF103,02,00,01,01  ;GSAを１秒間隔で出力
Cmd7=$PSRF103,02,00,03,01  ;GSAを３秒間隔で出力
Cmd8=$PSRF103,02,00,00,01  ;GSA off
Cmd9=$PSRF103,03,00,01,01  ;GSVを１秒間隔で出力
Cmd10=$PSRF103,03,00,03,01  ;GSVを３秒間隔で出力
Cmd11=$PSRF103,03,00,00,01  ;GSV off
Cmd12=$PSRF103,04,00,01,01  ;RMCを１秒間隔で出力
Cmd13=$PSRF103,04,00,00,01  ;RMC off
Cmd14=$PSRF103,05,00,01,01  ;VTGを１秒間隔で出力
Cmd15=$PSRF103,05,00,00,01  ;VTG off
Cmd16=$PSRF103,00,00,00,01|$PSRF103,01,00,00,01|$PSRF103,02,00,00,01|$PSRF103,03,00,00,01|$PSRF103,04,00,01,01|$PSRF103,05,00,00,01 ;RMCのみ１秒間隔で出力
Cmd17=$PSRF103,00,00,01,01|$PSRF103,01,00,01,01|$PSRF103,02,00,05,01|$PSRF103,03,00,05,01|$PSRF103,04,00,01,01|$PSRF103,05,00,01,01 ;全センテンスを出力
Cmd18=\A0\A2\0\18\81\2\1\1\0\1\5\1\5\1\1\1\0\1\0\1\0\1\0\1\0\1\12\C0\1\6B\B0\B3 ;Binary to NMEA(4800bps) mode \B4800\

[GpsCmd BU-353]
Cmd0=$PSRF104,0,0,0,96000,1,1,12,1 ;ホットスタート
Cmd1=$PSRF104,0,0,0,96000,1,1,12,2 ;ウォームスタート
Cmd2=$PSRF104,0,0,0,96000,1,1,12,4 ;コールドスタート
Cmd3=$PSRF104,0,0,0,96000,1,1,12,8 ;コールドスタート(工場初期値にリセット)
Cmd4=$PSRF106,21   ;WGS84 測地系
Cmd5=$PSRF106,178  ;Tokyo-Mean 測地系
Cmd6=$PSRF106,179  ;Tokyo 測地系
Cmd7=$PSRF106,180  ;Tokyo-Korea 測地系
Cmd8=$PSRF106,181  ;Tokyo-Okinawa 測地系
Cmd9=$PSRF103,00,00,01,01  ;GGAを１秒間隔で出力する
Cmd10=$PSRF103,00,00,00,01  ;GGA off
Cmd11=$PSRF103,01,00,01,01  ;GLLを１秒間隔で出力する
Cmd12=$PSRF103,01,00,00,01  ;GLL off
Cmd13=$PSRF103,02,00,01,01  ;GSAを１秒間隔で出力する
Cmd14=$PSRF103,02,00,03,01  ;GSAを３秒間隔で出力する
Cmd15=$PSRF103,02,00,00,01  ;GSA off
Cmd16=$PSRF103,03,00,01,01  ;GSVを１秒間隔で出力する
Cmd17=$PSRF103,03,00,03,01  ;GSVを３秒間隔で出力する
Cmd18=$PSRF103,03,00,00,01  ;GSV off
Cmd19=$PSRF103,04,00,01,01  ;RMCを１秒間隔で出力する
Cmd20=$PSRF103,04,00,00,01  ;RMC off
Cmd21=$PSRF103,05,00,01,01  ;VTGを１秒間隔で出力する
Cmd22=$PSRF103,05,00,00,01  ;VTG off
Cmd23=$PSRF103,00,00,00,01|$PSRF103,01,00,00,01|$PSRF103,02,00,00,01|$PSRF103,03,00,00,01|$PSRF103,04,00,01,01|$PSRF103,05,00,00,01 ;ORMCのみ１秒間隔で出力
Cmd24=$PSRF103,00,00,01,01|$PSRF103,01,00,01,01|$PSRF103,02,00,01,01|$PSRF103,03,00,05,01|$PSRF103,04,00,01,01|$PSRF103,05,00,01,01 ;全センテンスを出力
Cmd25=$PSRF150,0,1000,1000,0 ;省電力オフ
Cmd26=$PSRF150,0,300,1000,1  ;省電力オン
Cmd27=$PSRF151,00 ;WAAS/EGNOS オフ
Cmd28=$PSRF151,01 ;WAAS/EGNOS オン (自動)
Cmd29=$PSRF109,129 ;SBAS Channel PRN129 #42(MTSAT-1)
Cmd30=$PSRF109,137 ;SBAS Channel PRN137 #50(MTSAT-2)
Cmd31=$PSRF109,135 ;SBAS Channel PRN135 #48(WAAS)
Cmd32=$PSRF109,138 ;SBAS Channel PRN138 #51(WAAS)
Cmd33=$PSRF109,120 ;SBAS Channel PRN120 #33(EGNOS)
Cmd34=$PSRF109,124 ;SBAS Channel PRN124 #37(EGNOS)
Cmd35=$PSRF109,126 ;SBAS Channel PRN126 #39(EGNOS)
Cmd36=$PSRF109,131 ;SBAS Channel PRN131 #44(EGNOS)
Cmd37=\A0\A2\0\18\81\2\1\1\0\1\5\1\5\1\1\1\0\1\0\1\0\1\0\1\0\1\12\C0\1\6B\B0\B3 ;Binary to NMEA(4800bps) mode \B4800
Cmd38=$PSRF100,0,9600,8,1,0  ;NMEA to SiRF binary(9,600bps)  \B9600\

[GpsCmd BT-Q1000]
Cmd0=;*** GPSコマンドはUSB接続の場合のみ有効 ***
Cmd1=$PMTK605 ;リリース情報
Cmd2=$PMTK101 ;ホットスタート
Cmd3=$PMTK102 ;ウォームスタート
Cmd4=$PMTK103 ;コールドスタート
Cmd5=$PMTK104 ;コールドスタート(工場初期値にリセット)
Cmd6=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd7=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd8=$PMTK300,200,0,0,0,0  ;NMEAを 200mS周期で出力(5Hz)
Cmd9=$PMTK301,0 ;DGPSソース無し
Cmd10=$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd11=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd12=$PMTK313,0 ;SBAS を無効にする
Cmd13=$PMTK313,1 ;SBAS を有効にする
Cmd14=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd15=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd16=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd17=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd18=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd19=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd20=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd21=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd22=$PMTK320,0 ;省電力オフ
Cmd23=$PMTK320,1 ;省電力オン
Cmd24=$PMTK330,0 ;WGS-84  測地系
Cmd25=$PMTK330,1 ;Tokyo-M 測地系
Cmd26=$PMTK330,2 ;Tokyo-A 測地系
Cmd27=$PMTK400 ;NMEA出力周期の問合せ(mS)
Cmd28=$PMTK401 ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd29=$PMTK413 ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd30=$PMTK414 ;NMEA出力周期問合せ
Cmd31=$PMTK420 ;省電力モード問合せ(0:Off, 1:On)
Cmd32=$PMTK430 ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd33=$PMTK490 ;フラッシュメモリからユーザーセッティングの問合せ
Cmd34=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,2002F ;\\ デフォルトのログ項目 (ログ削除 & 停止) \\
Cmd35=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,2003F ;\\ デフォルトのログ項目+高度 (ログ削除 & 停止) \\
Cmd36=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,6003F ;\\ デフォルトのログ項目+高度+ミリ秒 (ログ削除 & 停止) \\
Cmd37=$PMTK182,1,3,002|$PMTK300,200,0,0,0,0   ;0.2秒毎のログ (非公認)
Cmd38=$PMTK182,1,3,003|$PMTK300,300,0,0,0,0   ;0.3秒毎のログ (非公認)
Cmd39=$PMTK182,1,3,004|$PMTK300,400,0,0,0,0   ;0.4秒毎のログ (非公認)
Cmd40=$PMTK182,1,3,005|$PMTK300,500,0,0,0,0   ;0.5秒毎のログ (非公認)
Cmd41=$PMTK182,1,3,010|$PMTK300,1000,0,0,0,0  ; 1秒毎のログ(1..999)
Cmd42=$PMTK182,1,3,050|$PMTK300,1000,0,0,0,0  ; 5秒毎のログ
Cmd43=$PMTK182,1,3,100|$PMTK300,1000,0,0,0,0  ;10秒毎のログ
Cmd44=$PMTK182,1,4,100  ;10m毎のログ(10..9999m)
Cmd45=$PMTK182,1,4,300  ;30m毎のログ
Cmd46=$PMTK182,1,5,500  ; 50Km/hの速度超過ログ(10..999Km/h)
Cmd47=$PMTK182,1,5,1000 ;100Km/hの速度超過ログ
Cmd48=$PMTK182,1,3,0 ;経過時間によるログを無効にする
Cmd49=$PMTK182,1,4,0 ;移動距離によるログを無効にする
Cmd50=$PMTK182,1,5,0 ;速度超過によるログを無効にする
Cmd51=$PMTK182,1,6,1 ;ログ上書きモードに設定する
Cmd52=$PMTK182,1,6,2 ;メモリー・フルでログ停止に設定する
Cmd53=$PMTK182,4 ;ログを有効にする(ログ開始)
Cmd54=$PMTK182,5 ;ログを無効にする(ログ停止)
Cmd55=$PMTK182,6,1 ;ログを削除&ログ停止
Cmd56=$PMTK182,6,1||||||||||||||||$PMTK182,4 ;\\ ログ削除 & ログ開始 \\
Cmd57=$PMTK182,2,2  ;ログ項目設定の問合せ
Cmd58=$PMTK182,2,3  ;経過時間によるログ設定の問合せ(0.1S)
Cmd59=$PMTK182,2,4  ;移動距離によるログ設定の問合せ(0.1m)
Cmd60=$PMTK182,2,5  ;速度超過によるログ設定の問合せ(0.1Km/h)
Cmd61=$PMTK182,2,6  ;ログモード設定の問合せ(1:上書 2:停止)
Cmd62=$PMTK182,2,8  ;ログバイト数の問合せ(Hex)
Cmd63=$PMTK182,2,10 ;ログレコード数の問合せ(Hex)
Cmd64=; \PMTK335\ RTC time を現在時刻に設定する（EOWロールオーバー対策） 

[GpsCmd BT-Q1000X]
Cmd0=$PMTK605 ;リリース情報
Cmd1=$PMTK101 ;ホットスタート
Cmd2=$PMTK102 ;ウォームスタート
Cmd3=$PMTK103 ;コールドスタート
Cmd4=$PMTK104 ;コールドスタート(工場初期値にリセット)
Cmd5=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd6=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd7=$PMTK300,200,0,0,0,0  ;NMEAを 200mS周期で出力(5Hz)
Cmd8=$PMTK301,0 ;DGPSソース無し
Cmd9=$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd10=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd11=$PMTK313,0 ;SBAS を無効にする
Cmd12=$PMTK313,1 ;SBAS を有効にする
Cmd13=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd15=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd16=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd17=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd18=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd19=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd21=$PMTK320,0 ;省電力オフ
Cmd22=$PMTK320,1 ;省電力オン
Cmd23=$PMTK330,0 ;WGS-84  測地系
Cmd24=$PMTK330,1 ;Tokyo-M 測地系
Cmd25=$PMTK330,2 ;Tokyo-A 測地系
Cmd26=$PMTK400 ;NMEA出力周期の問合せ(mS)
Cmd27=$PMTK401 ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd28=$PMTK413 ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd29=$PMTK414 ;NMEA出力周期問合せ
Cmd30=$PMTK420 ;省電力モード問合せ(0:Off, 1:On)
Cmd31=$PMTK430 ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd32=$PMTK490 ;フラッシュメモリからユーザーセッティングの問合せ
Cmd33=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,2002F ;\\ デフォルトのログ項目 (ログ削除 & 停止) \\
Cmd34=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,2003F ;\\ デフォルトのログ項目+高度 (ログ削除 & 停止) \\
Cmd35=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,6003F ;\\ デフォルトのログ項目+高度+ミリ秒 (ログ削除 & 停止) \\
Cmd36=$PMTK182,1,3,002|$PMTK300,200,0,0,0,0   ;0.2秒毎のログ (非公認)
Cmd37=$PMTK182,1,3,003|$PMTK300,300,0,0,0,0   ;0.3秒毎のログ (非公認)
Cmd38=$PMTK182,1,3,004|$PMTK300,400,0,0,0,0   ;0.4秒毎のログ (非公認)
Cmd39=$PMTK182,1,3,005|$PMTK300,500,0,0,0,0   ;0.5秒毎のログ (非公認)
Cmd40=$PMTK182,1,3,010|$PMTK300,1000,0,0,0,0  ; 1秒毎のログ(1..999)
Cmd41=$PMTK182,1,3,050|$PMTK300,1000,0,0,0,0  ; 5秒毎のログ
Cmd42=$PMTK182,1,3,100|$PMTK300,1000,0,0,0,0  ;10秒毎のログ
Cmd43=$PMTK182,1,4,100  ;10m毎のログ(10..9999m)
Cmd44=$PMTK182,1,4,300  ;30m毎のログ
Cmd45=$PMTK182,1,5,500  ; 50Km/hの速度超過ログ(10..999Km/h)
Cmd46=$PMTK182,1,5,1000 ;100Km/hの速度超過ログ
Cmd47=$PMTK182,1,3,0 ;経過時間によるログを無効にする
Cmd48=$PMTK182,1,4,0 ;移動距離によるログを無効にする
Cmd49=$PMTK182,1,5,0 ;速度超過によるログを無効にする
Cmd50=$PMTK182,1,6,1 ;ログ上書きモードに設定する
Cmd51=$PMTK182,1,6,2 ;メモリー・フルでログ停止に設定する
Cmd52=$PMTK182,4 ;ログを有効にする(ログ開始)
Cmd53=$PMTK182,5 ;ログを無効にする(ログ停止)
Cmd54=$PMTK182,6,1 ;ログを削除&ログ停止
Cmd55=$PMTK182,6,1||||||||||||||||$PMTK182,4 ;\\ ログ削除 & ログ開始 \\
Cmd56=$PMTK182,2,2  ;ログ項目設定の問合せ
Cmd57=$PMTK182,2,3  ;経過時間によるログ設定の問合せ(0.1S)
Cmd58=$PMTK182,2,4  ;移動距離によるログ設定の問合せ(0.1m)
Cmd59=$PMTK182,2,5  ;速度超過によるログ設定の問合せ(0.1Km/h)
Cmd60=$PMTK182,2,6  ;ログモード設定の問合せ(1:上書 2:停止)
Cmd61=$PMTK182,2,8  ;ログバイト数の問合せ(Hex)
Cmd62=$PMTK182,2,10 ;ログレコード数の問合せ(Hex)
Cmd63=$PMTK607  ;AGPS情報問い合わせ
Cmd64=$PMTK127  ;\\ AGPSデータをリセットします \\
Cmd65=; \PMTK335\ RTC time を現在時刻に設定する（EOWロールオーバー対策）

[GpsCmd i-Blue747A+]
Cmd0=$PMTK605 ;リリース情報
Cmd1=$PMTK101 ;ホットスタート
Cmd2=$PMTK102 ;ウォームスタート
Cmd3=$PMTK103 ;コールドスタート
Cmd4=$PMTK104 ;コールドスタート(工場初期値にリセット)
Cmd5=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd6=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd7=$PMTK300,200,0,0,0,0  ;NMEAを 200mS周期で出力(5Hz)
Cmd8=$PMTK301,0 ;DGPSソース無し
Cmd9=$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd10=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd11=$PMTK313,0 ;SBAS を無効にする
Cmd12=$PMTK313,1 ;SBAS を有効にする
Cmd13=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd15=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd16=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd17=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd18=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd19=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd21=$PMTK320,0 ;省電力オフ
Cmd22=$PMTK320,1 ;省電力オン
Cmd23=$PMTK330,0 ;WGS-84  測地系
Cmd24=$PMTK330,1 ;Tokyo-M 測地系
Cmd25=$PMTK330,2 ;Tokyo-A 測地系
Cmd26=$PMTK400 ;NMEA出力周期の問合せ(mS)
Cmd27=$PMTK401 ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd28=$PMTK413 ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd29=$PMTK414 ;NMEA出力周期問合せ
Cmd30=$PMTK420 ;省電力モード問合せ(0:Off, 1:On)
Cmd31=$PMTK430 ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd32=$PMTK490 ;フラッシュメモリからユーザーセッティングの問合せ
Cmd33=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,2002F ;\\ デフォルトのログ項目 (ログ削除 & 停止) \\
Cmd34=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,2003F ;\\ デフォルトのログ項目+高度 (ログ削除 & 停止) \\
Cmd35=$PMTK182,6,1||||||||||||||||$PMTK182,1,2,6003F ;\\ デフォルトのログ項目+高度+ミリ秒 (ログ削除 & 停止) \\
Cmd36=$PMTK182,1,3,002|$PMTK300,200,0,0,0,0   ;0.2秒毎のログ (非公認)
Cmd37=$PMTK182,1,3,003|$PMTK300,300,0,0,0,0   ;0.3秒毎のログ (非公認)
Cmd38=$PMTK182,1,3,004|$PMTK300,400,0,0,0,0   ;0.4秒毎のログ (非公認)
Cmd39=$PMTK182,1,3,005|$PMTK300,500,0,0,0,0   ;0.5秒毎のログ (非公認)
Cmd40=$PMTK182,1,3,010|$PMTK300,1000,0,0,0,0  ; 1秒毎のログ(1..999)
Cmd41=$PMTK182,1,3,050|$PMTK300,1000,0,0,0,0  ; 5秒毎のログ
Cmd42=$PMTK182,1,3,100|$PMTK300,1000,0,0,0,0  ;10秒毎のログ
Cmd43=$PMTK182,1,4,100  ;10m毎のログ(10..9999m)
Cmd44=$PMTK182,1,4,300  ;30m毎のログ
Cmd45=$PMTK182,1,5,500  ; 50Km/hの速度超過ログ(10..999Km/h)
Cmd46=$PMTK182,1,5,1000 ;100Km/hの速度超過ログ
Cmd47=$PMTK182,1,3,0 ;経過時間によるログを無効にする
Cmd48=$PMTK182,1,4,0 ;移動距離によるログを無効にする
Cmd49=$PMTK182,1,5,0 ;速度超過によるログを無効にする
Cmd50=$PMTK182,1,6,1 ;ログ上書きモードに設定する
Cmd51=$PMTK182,1,6,2 ;メモリー・フルでログ停止に設定する
Cmd52=$PMTK182,4 ;ログを有効にする(ログ開始)
Cmd53=$PMTK182,5 ;ログを無効にする(ログ停止)
Cmd54=$PMTK182,6,1 ;ログを削除&ログ停止
Cmd55=$PMTK182,6,1||||||||||||||||$PMTK182,4 ;\\ ログ削除 & ログ開始 \\
Cmd56=$PMTK182,2,2  ;ログ項目設定の問合せ
Cmd57=$PMTK182,2,3  ;経過時間によるログ設定の問合せ(0.1S)
Cmd58=$PMTK182,2,4  ;移動距離によるログ設定の問合せ(0.1m)
Cmd59=$PMTK182,2,5  ;速度超過によるログ設定の問合せ(0.1Km/h)
Cmd60=$PMTK182,2,6  ;ログモード設定の問合せ(1:上書 2:停止)
Cmd61=$PMTK182,2,8  ;ログバイト数の問合せ(Hex)
Cmd62=$PMTK182,2,10 ;ログレコード数の問合せ(Hex)
Cmd63=$PMTK607  ;AGPS情報問い合わせ
Cmd64=$PMTK127  ;\\ AGPSデータをリセットします \\

[GpsCmd M-1000]
Cmd0=$PMTK605 ;リリース情報
Cmd1=$PMTK101 ;ホットスタート
Cmd2=$PMTK102 ;ウォームスタート
Cmd3=$PMTK103 ;コールドスタート
Cmd4=$PMTK104 ;コールドスタート(工場初期値にリセット)
Cmd5=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd6=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd7=$PMTK300,200,0,0,0,0  ;NMEAを 200mS周期で出力(5Hz)
Cmd8=$PMTK301,0 ;DGPSソース無し
Cmd9==$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd10=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd11=$PMTK313,0 ;SBAS を無効にする
Cmd12=$PMTK313,1 ;SBAS を有効にする
Cmd13=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd15=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd16=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd17=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd18=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd19=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd21=$PMTK320,0 ;省電力オフ
Cmd22=$PMTK320,1 ;省電力オン
Cmd23=$PMTK330,0 ;WGS-84  測地系
Cmd24=$PMTK330,1 ;Tokyo-M 測地系
Cmd25=$PMTK330,2 ;Tokyo-A 測地系
Cmd26=$PMTK400 ;NMEA出力周期の問合せ(mS)
Cmd27=$PMTK401 ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd28=$PMTK413 ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd29=$PMTK414 ;NMEA出力周期問合せ
Cmd30=$PMTK420 ;省電力モード問合せ(0:Off, 1:On)
Cmd31=$PMTK430 ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd32=$PMTK490 ;フラッシュメモリからユーザーセッティングの問合せ
Cmd33=; \PMTK335\ RTC time を現在時刻に設定する（EOWロールオーバー対策）

[GpsCmd M-241]
Cmd0=; *1: HOLUX Logger Utility を使用する場合は工場初期値にリセットするか５秒毎のログに設定すること。
Cmd1=; *1: GPSのスイッチ操作、上書/停止の切換え、距離によるログの設定でクリアされる。
Cmd2=$PMTK605 ;リリース情報
Cmd3=$PMTK101 ;ホットスタート
Cmd4=$PMTK102 ;ウォームスタート
Cmd5=$PMTK103 ;コールドスタート
Cmd6=$PMTK104 ;コールドスタート(工場初期値にリセット)
Cmd7=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd8=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd9=$PMTK300,200,0,0,0,0  ;NMEAを 200mS周期で出力(5Hz)
Cmd10=$PMTK301,0 ;DGPSソース無し
Cmd11=$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd12=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd13=$PMTK313,0 ;SBAS を無効にする
Cmd14=$PMTK313,1 ;SBAS を有効にする
Cmd15=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd16=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd17=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd18=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd19=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd21=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd22=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd23=$PMTK320,0 ;省電力オフ
Cmd24=$PMTK320,1 ;省電力オン
Cmd25=$PMTK330,0 ;WGS-84  測地系
Cmd26=$PMTK330,1 ;Tokyo-M 測地系
Cmd27=$PMTK330,2 ;Tokyo-A 測地系
Cmd28=$PMTK400 ;NMEA出力周期の問合せ(mS)
Cmd29=$PMTK401 ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd30=$PMTK413 ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd31=$PMTK414 ;NMEA出力周期問合せ
Cmd32=$PMTK420 ;省電力モード問合せ(0:Off, 1:On)
Cmd33=$PMTK430 ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd34=$PMTK490 ;フラッシュメモリからユーザーセッティングの問合せ
Cmd35=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,002|$PMTK300,200,0,0,0,0  ;0.2秒毎のログ (非公認) *1
Cmd36=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,003|$PMTK300,300,0,0,0,0  ;0.3秒毎のログ (非公認) *1
Cmd37=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,004|$PMTK300,400,0,0,0,0  ;0.4秒毎のログ (非公認) *1
Cmd38=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,005|$PMTK300,500,0,0,0,0  ;0.5秒毎のログ (非公認) *1
Cmd39=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,010|$PMTK300,1000,0,0,0,0 ; 1秒毎のログ(1..999)   *1
Cmd40=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,050|$PMTK300,1000,0,0,0,0 ; 5秒毎のログ
Cmd41=$HOLUX241,9,0|$HOLUX241,2||||||||||||$PMTK182,1,3,100|$PMTK300,1000,0,0,0,0 ;10秒毎のログ
Cmd42=$HOLUX241,9,1|$HOLUX241,2||||||||||||$PMTK182,1,4,100  ; 10m毎のログ(10..9999m)
Cmd43=$HOLUX241,9,1|$HOLUX241,2||||||||||||$PMTK182,1,4,300  ; 30m毎のログ
Cmd44=$HOLUX241,9,1|$HOLUX241,2||||||||||||$PMTK182,1,4,500  ; 50m毎のログ
Cmd45=$HOLUX241,9,1|$HOLUX241,2||||||||||||$PMTK182,1,4,1000 ;100m毎のログ
Cmd46=$PMTK182,1,5,100  ; 10Km/hの速度超過ログ(10..999Km/h)
Cmd47=$PMTK182,1,5,500  ; 50Km/hの速度超過ログ
Cmd48=$PMTK182,1,5,1000 ;100Km/hの速度超過ログ
Cmd49=$PMTK182,1,3,0 ;経過時間によるログを無効にする
Cmd50=$PMTK182,1,4,0 ;移動距離によるログを無効にする
Cmd51=$PMTK182,1,5,0 ;速度超過によるログを無効にする
Cmd52=$PMTK182,1,6,1|$HOLUX241,2 ;ログ上書きモードに設定する(エンドレス)
Cmd53=$PMTK182,1,6,2|$HOLUX241,2 ;メモリー・フルでログ停止に設定する
Cmd54=$PMTK182,4  ;ログ開始(ログを有効にする)
Cmd55=$PMTK182,5  ;ログ停止(ログを無効にする)
Cmd56=$PMTK182,6,1 ;\\ ログを削除 & ログ停止 \\
Cmd57=$PMTK182,6,1||||||||||||||||$PMTK182,4 ;\\ ログ削除 & ログ開始 \\
Cmd58=$PMTK182,2,2  ;ログ項目設定の問合せ
Cmd59=$PMTK182,2,3  ;経過時間によるログ設定の問合せ(0.1S)
Cmd60=$PMTK182,2,4  ;移動距離によるログ設定の問合せ(0.1m)
Cmd61=$PMTK182,2,5  ;速度超過によるログ設定の問合せ(0.1Km/h)
Cmd62=$PMTK182,2,6  ;ログモード設定の問合せ(1:上書 2:停止)
Cmd63=$PMTK182,2,8  ;ログバイト数の問合せ(Hex)
Cmd64=$PMTK182,2,10 ;ログレコード数の問合せ(Hex)
Cmd65=; \PMTK335\ RTC time を現在時刻に設定する（EOWロールオーバー対策）

[GpsCmd V-900]
Cmd0=$PMTK605 ;リリース情報
Cmd1=$PMTK101 ;ホットスタート
Cmd2=$PMTK102 ;ウォームスタート
Cmd3=$PMTK103 ;コールドスタート
Cmd4=$PMTK104 ;コールドスタート(工場初期値にリセット)
Cmd5=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd6=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd7=$PMTK300,200,0,0,0,0  ;NMEAを 200mS周期で出力(5Hz)
Cmd8=$PMTK301,0 ;DGPSソース無し
Cmd9=$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd10=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd11=$PMTK313,0 ;SBAS を無効にする
Cmd12=$PMTK313,1 ;SBAS を有効にする
Cmd13=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PMTK314,0,1,0,1,1,10,0,0,0,0,0,0,0,0,0,0,1,0,0;GGA,GSA,RMC 1秒,GSV10秒間隔で出力
Cmd15=$PMTK314,0,1,0,1,1,5,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,RMC 1秒,GSV5秒間隔で出力
Cmd16=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd17=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,RMC 1秒間隔. GSA,GSV 3秒間隔
Cmd18=$PMTK314,1,1,0,1,1,5,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,RMC,GLL 1秒間隔. GSV 5秒間隔で出力
Cmd19=$PMTK314,0,1,1,1,1,5,0,0,0,0,0,0,0,0,0,0,1,0,0 ;GGA,GSA,RMC,VTG 1秒間隔. GSV 5秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,5,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,RMC,ZDA 1秒間隔. GSV 5秒間隔で出力
Cmd21=$PMTK314,1,1,1,1,1,5,0,0,0,0,0,0,0,0,0,0,1,1,0 ;GGA,GSA,RMC,GLL,VTG,ZDA 1秒間隔. GSV 5秒間隔で出力
Cmd22=$PMTK314,0,1,0,1,1,5,0,0,0,0,0,0,0,0,0,0,1,0,1 ;GGA,GSA,RMC,CHN 1秒間隔. GSV 5秒間隔で出力
Cmd23=$PMTK320,0 ;省電力オフ
Cmd24=$PMTK320,1 ;省電力オン
Cmd25=$PMTK330,0 ;WGS-84  測地系
Cmd26=$PMTK330,1 ;Tokyo-M 測地系
Cmd27=$PMTK330,2 ;Tokyo-A 測地系
Cmd28=$PMTK400 ;NMEA出力周期の問合せ(mS)
Cmd29=$PMTK401 ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd30=$PMTK413 ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd31=$PMTK414 ;NMEA出力周期問合せ
Cmd32=$PMTK420 ;省電力モード問合せ(0:Off, 1:On)
Cmd33=$PMTK430 ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd34=$PMTK490 ;フラッシュメモリからユーザーセッティングの問合せ
Cmd35=; \PMTK335\ RTC time を現在時刻に設定する（EOWロールオーバー対策）

[GpsCmd Gms-g6a]
Cmd0=$PMTK605    ;リリース情報
Cmd1=$PMTK101    ;ホットスタート
Cmd2=$PMTK102    ;ウォームスタート
Cmd3=$PMTK103    ;コールドスタート
Cmd4=$PMTK104    ;コールドスタート(工場初期値にリセット)
Cmd5=$PMTK300,2000,0,0,0,0 ;NMEAを2000mS周期で出力(0.5Hz)
Cmd6=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd7=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd8=$PMTK301,0  ;DGPSソース無し
Cmd9=$PMTK301,1  ;DGPSソースをRTCMに設定する
Cmd10=$PMTK301,2  ;DGPSソースをWAASに設定する
Cmd11=$PMTK313,0  ;SBAS を無効にする
Cmd12=$PMTK313,1  ;SBAS を有効にする
Cmd13=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd15=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd16=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd17=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd18=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd19=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd21=$PMTK330,0 ;WGS-84  測地系
Cmd22=$PMTK330,1 ;Tokyo-M 測地系
Cmd23=$PMTK330,2 ;Tokyo-A 測地系
Cmd24=$PMTK400   ;NMEA出力周期の問合せ(mS)
Cmd25=$PMTK401   ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd26=$PMTK413   ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd27=$PMTK414   ;NMEA出力周期問合せ
Cmd28=$PMTK420   ;省電力モード問合せ(0:Off, 1:On)
Cmd29=$PMTK430   ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd30=$PMTK490   ;フラッシュメモリからユーザーセッティングの問合せ
Cmd31=$PMTK607   ;AGPS情報問い合わせ
Cmd32=$PMTK127   ;\\ AGPSデータをリセットします \\
Cmd33=$PMTK183   ;ログ・ステイタス要求
Cmd34=$PMTK622,1 ;ログデータのダウンロード
Cmd35=$PMTK184,1 ;\\ログデータを削除します\\
Cmd36=$PMTK185,0 ;ログ開始
Cmd37=$PMTK185,1 ;ログ停止
Cmd38=$PMTK225,0 ;通常モードに戻る
Cmd39=$PMTK225,8 ;AlwaysLocate standby mode にする
Cmd40=$PMTK286,1 ;妨害電波を抑制する
Cmd41=$PMTK286,0 ;妨害電波を抑制しない
Cmd42=$PMTK319,1 ;テストフラグ有りのSBASは受信しない
Cmd43=$PMTK319,0 ;テストフラグ有りのSBASも受信する
Cmd44=$PMTK869,1,1 ;EASY機能を有効にする
Cmd45=$PMTK869,1,0 ;EASY機能を無効にする
Cmd46=$PMTK869,0   ;EASY機能状態の問合せ
Cmd47=$PMTK251,115200    ;RS-232Cボーレートを 115,200bpsに設定 \B115200\
Cmd48=$PMTK251,9600      ;RS-232Cボーレートを   9,600bpsに設定 \B9600\
Cmd49=$PMTK253,1,115200  ;NMEA to Binary mode 115,200bps
Cmd50=$PMTK253,1,9600    ;NMEA to Binary mode   9,600bps
Cmd51=\04\24\0E\00\FD\00\00\00\C2\01\00\30* ;Binary to NMEA mode 115,200bps
Cmd52=\04\24\0E\00\FD\00\00\80\25\00\00\56* ;Binary to NMEA mode   9,600bps
Cmd53=$PMTK187,1,1  ;ログ周期を1秒に設定する
Cmd54=$PMTK187,1,5  ;ログ周期を5秒に設定する
Cmd55=$PMTK187,1,10 ;ログ周期を10秒に設定する
Cmd56=$PMTK352,0  ;QZSS機能を有効にする
Cmd57=$PMTK352,1  ;QZSS機能を無効にする
Cmd58=$PMTK351,0  ;QZSSのNMEAを無効にする
Cmd59=$PMTK351,1  ;QZSSのNMEAを有効にする
Cmd60=$PMTK386,0    ;スタティックナビゲーションをオフにする
Cmd61=$PMTK386,0.6  ;ナビ閾値を0.6m/sにセットする (0/0.2/0.4/0.6/0.8/1.0/1.5/2.0 m/s)
Cmd62=$PMTK447      ;ナビゲーション閾値を問い合わせる (m/s)
Cmd63=$PMTK186,1    ;現在のデータをワンショットで記録する（ログ開始中のみ有効）
Cmd64=$PMTK104||$PMTK353,1,0,0,0,0  ;GPS のみ
Cmd65=$PMTK104||$PMTK353,0,1,0,0,0  ;GLONASS のみ
Cmd66=$PMTK104||$PMTK353,1,1,0,0,0  ;GPS + GLONASS
Cmd67=$PMTK104||$PMTK353,1,0,1,0,0  ;GPS + GALILEO
Cmd68=$PMTK104||$PMTK353,1,0,0,1,0  ;GPS + GALILEO_full
Cmd69=$PMTK104||$PMTK353,1,1,1,0,0  ;GPS + GLONASS + GALILEO

[GpsCmd GNS 2000]
Cmd0=$PGNS,MTK|$PMTK605    ;リリース情報
Cmd1=$PGNS,MTK|$PMTK101    ;ホットスタート
Cmd2=$PGNS,MTK|$PMTK102    ;ウォームスタート
Cmd3=$PGNS,MTK|$PMTK103    ;コールドスタート
Cmd4=$PGNS,MTK|$PMTK104    ;コールドスタート(工場初期値にリセット)
Cmd5=$PGNS,MTK|$PMTK300,2000,0,0,0,0 ;NMEAを2000mS周期で出力(0.5Hz)
Cmd6=$PGNS,MTK|$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd7=$PGNS,MTK|$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd8=$PGNS,MTK|$PMTK301,0  ;DGPSソース無し
Cmd9=$PGNS,MTK|$PMTK301,1  ;DGPSソースをRTCMに設定する
Cmd10=$PGNS,MTK|$PMTK301,2  ;DGPSソースをWAASに設定する
Cmd11=$PGNS,MTK|$PMTK313,0  ;SBAS を無効にする
Cmd12=$PGNS,MTK|$PMTK313,1  ;SBAS を有効にする
Cmd13=$PGNS,MTK|$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PGNS,MTK|$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd15=$PGNS,MTK|$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd16=$PGNS,MTK|$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd17=$PGNS,MTK|$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd18=$PGNS,MTK|$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd19=$PGNS,MTK|$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd20=$PGNS,MTK|$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd21=$PGNS,MTK|$PMTK330,0 ;WGS-84  測地系
Cmd22=$PGNS,MTK|$PMTK330,1 ;Tokyo-M 測地系
Cmd23=$PGNS,MTK|$PMTK330,2 ;Tokyo-A 測地系
Cmd24=$PGNS,MTK|$PMTK400   ;NMEA出力周期の問合せ(mS)
Cmd25=$PGNS,MTK|$PMTK401   ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd26=$PGNS,MTK|$PMTK413   ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd27=$PGNS,MTK|$PMTK414   ;NMEA出力周期問合せ
Cmd28=$PGNS,MTK|$PMTK420   ;省電力モード問合せ(0:Off, 1:On)
Cmd29=$PGNS,MTK|$PMTK430   ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd30=$PGNS,MTK|$PMTK490   ;フラッシュメモリからユーザーセッティングの問合せ
Cmd31=$PGNS,V              ;バージョン情報
Cmd32=$PGNS,R              ;ログデータのダウンロード
Cmd33=$PGNS,C              ;\\ログデータを削除します\\
Cmd34=$PGNS,MTK|$PMTK183   ;ログ・ステイタス要求
Cmd35=$PGNS,MTK|$PMTK185,0 ;ログ開始
Cmd36=$PGNS,MTK|$PMTK185,1 ;ログ停止
Cmd37=$PGNS,MTK|$PMTK225,0 ;通常モードに戻る
Cmd38=$PGNS,MTK|$PMTK225,8 ;AlwaysLocate standby mode にする
Cmd39=$PGNS,MTK|$PMTK286,1 ;妨害電波を抑制する
Cmd40=$PGNS,MTK|$PMTK286,0 ;妨害電波を抑制しない
Cmd41=$PGNS,MTK|$PMTK319,1 ;テストフラグ有りのSBASは受信しない
Cmd42=$PGNS,MTK|$PMTK319,0 ;テストフラグ有りのSBASも受信する
Cmd43=$PGNS,MTK|$PMTK869,1,1 ;EASY機能を有効にする
Cmd44=$PGNS,MTK|$PMTK869,1,0 ;EASY機能を無効にする
Cmd45=$PGNS,MTK|$PMTK869,0   ;EASY機能状態の問合せ
Cmd46=$PGNS,MTK|$PMTK187,1,1  ;ログ周期を1秒に設定する
Cmd47=$PGNS,MTK|$PMTK187,1,5  ;ログ周期を5秒に設定する
Cmd48=$PGNS,MTK|$PMTK187,1,10 ;ログ周期を10秒に設定する
Cmd49=$PGNS,MTK|$PMTK386,0    ;スタティックナビゲーションをオフにする
Cmd50=$PGNS,MTK|$PMTK386,0.6  ;ナビ閾値を0.6m/sにセットする (0/0.2/0.4/0.6/0.8/1.0/1.5/2.0 m/s)
Cmd51=$PGNS,MTK|$PMTK447      ;ナビゲーション閾値を問い合わせる (m/s)
Cmd52=$PGNS,MTK|$PMTK186,1    ;現在のデータをワンショットで記録する（ログ開始中のみ有効）
Cmd53=$PGNS,MTK|$PMTK104||$PGNS,MTK|$PMTK353,1,0  ;GPS のみサーチする
Cmd54=$PGNS,MTK|$PMTK104||$PGNS,MTK|$PMTK353,0,1  ;GLONASS のみサーチする
Cmd55=$PGNS,MTK|$PMTK104||$PGNS,MTK|$PMTK353,1,1  ;GPS と GLONASS をサーチする

[GpsCmd Gms-b6]
Cmd0=$PMTK605    ;リリース情報
Cmd1=$PMTK101    ;ホットスタート
Cmd2=$PMTK102    ;ウォームスタート
Cmd3=$PMTK103    ;コールドスタート
Cmd4=$PMTK104    ;コールドスタート(工場初期値にリセット)
Cmd5=$PMTK300,2000,0,0,0,0 ;NMEAを2000mS周期で出力(0.5Hz)
Cmd6=$PMTK300,1000,0,0,0,0 ;NMEAを1000mS周期で出力(1Hz)
Cmd7=$PMTK300,500,0,0,0,0  ;NMEAを 500mS周期で出力(2Hz)
Cmd8=$PMTK301,0  ;DGPSソース無し
Cmd9=$PMTK301,1  ;DGPSソースをRTCMに設定する
Cmd10=$PMTK301,2  ;DGPSソースをWAASに設定する
Cmd11=$PMTK313,0  ;SBAS を無効にする
Cmd12=$PMTK313,1  ;SBAS を有効にする
Cmd13=$PMTK314,-1 ;デフォルトのNMEAセンテンスを出力
Cmd14=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC 1秒間隔で出力
Cmd15=$PMTK314,0,1,0,1,3,3,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,RMC:1秒間隔. GSA,GSV:3秒間隔
Cmd16=$PMTK314,1,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC,GLL 1秒間隔で出力
Cmd17=$PMTK314,0,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,0 ;GGA,GSA,GSV,RMC,VTG 1秒間隔で出力
Cmd18=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0 ;GGA,GSA,GSV,RMC,ZDA 1秒間隔で出力
Cmd19=$PMTK314,1,1,1,1,1,1,0,0,0,0,0,0,0,0,0,0,0,1,0 ;GGA,GSA,GSV,RMC,GLL,VTG,ZDA 1秒間隔で出力
Cmd20=$PMTK314,0,1,0,1,1,1,0,0,0,0,0,0,0,0,0,0,0,0,1 ;GGA,GSA,GSV,RMC,CHN 1秒間隔で出力
Cmd21=$PMTK330,0 ;WGS-84  測地系
Cmd22=$PMTK330,1 ;Tokyo-M 測地系
Cmd23=$PMTK330,2 ;Tokyo-A 測地系
Cmd24=$PMTK400   ;NMEA出力周期の問合せ(mS)
Cmd25=$PMTK401   ;DGPSモード問合せ(0:No DGPS, 1:RTCM, 2:WAAS)
Cmd26=$PMTK413   ;SBAS有効問合せ(0:Disable, 1:Enable)
Cmd27=$PMTK414   ;NMEA出力周期問合せ
Cmd28=$PMTK420   ;省電力モード問合せ(0:Off, 1:On)
Cmd29=$PMTK430   ;デフォルト測地系問合せ(0:WGS84, 1:Tokyo-M 2:Tokyo-A)
Cmd30=$PMTK490   ;フラッシュメモリからユーザーセッティングの問合せ
Cmd31=$PMTK607   ;AGPS情報問い合わせ
Cmd32=$PMTK127   ;\\ AGPSデータをリセットします \\
Cmd33=$PMTK183   ;ログ・ステイタス要求
Cmd34=$PMTK622,1 ;ログデータのダウンロード
Cmd35=$PMTK184,1 ;\\ログデータを削除します\\
Cmd36=$PMTK185,0 ;ログ開始
Cmd37=$PMTK185,1 ;ログ停止
Cmd38=$PMTK225,0 ;通常モードに戻る
Cmd39=$PMTK225,8 ;AlwaysLocate standby mode にする
Cmd40=$PMTK286,1 ;妨害電波を抑制する
Cmd41=$PMTK286,0 ;妨害電波を抑制しない
Cmd42=$PMTK319,1 ;テストフラグ有りのSBASは受信しない
Cmd43=$PMTK319,0 ;テストフラグ有りのSBASも受信する
Cmd44=$PMTK869,1,1 ;EASY機能を有効にする
Cmd45=$PMTK869,1,0 ;EASY機能を無効にする
Cmd46=$PMTK869,0   ;EASY機能状態の問合せ
Cmd47=$PMTK251,115200    ;RS-232Cボーレートを 115,200bpsに設定 \B115200\
Cmd48=$PMTK251,9600      ;RS-232Cボーレートを   9,600bpsに設定 \B9600\
Cmd49=$PMTK253,1,115200  ;NMEA to Binary mode 115,200bps
Cmd50=$PMTK253,1,9600    ;NMEA to Binary mode   9,600bps
Cmd51=\04\24\0E\00\FD\00\00\00\C2\01\00\30 ;Binary to NMEA mode 115,200bps
Cmd52=\04\24\0E\00\FD\00\00\80\25\00\00\56 ;Binary to NMEA mode   9,600bps
Cmd53=$PMTK187,1,1  ;ログ周期を1秒に設定する
Cmd54=$PMTK187,1,5  ;ログ周期を5秒に設定する
Cmd55=$PMTK187,1,10 ;ログ周期を10秒に設定する
Cmd56=$PMTK352,0  ;QZSS機能を有効にする
Cmd57=$PMTK352,1  ;QZSS機能を無効にする
Cmd58=$PMTK351,0  ;QZSSのNMEAを無効にする
Cmd59=$PMTK351,1  ;QZSSのNMEAを有効にする
Cmd60=$PMTK386,0    ;スタティックナビゲーションをオフにする
Cmd61=$PMTK386,0.6  ;ナビ閾値を0.6m/sにセットする (0/0.2/0.4/0.6/0.8/1.0/1.5/2.0 m/s)
Cmd62=$PMTK447      ;ナビゲーション閾値を問い合わせる (m/s)
Cmd63=$PMTK186,1    ;現在のデータをワンショットで記録する（ログ開始中のみ有効）
Cmd64=$PMTK104||$PMTK353,1,0,0,0,0  ;GPS のみサーチする
Cmd65=$PMTK104||$PMTK353,0,0,0,0,1  ;BD のみサーチする
Cmd66=$PMTK104||$PMTK353,1,0,0,0,1  ;GPS と BD をサーチする

[GpsCmd LEA-6T]
Cmd0=\B5\62\06\04\04\00\00\00\02\00\10\68 ;ホットスタート
Cmd1=\B5\62\06\04\04\00\01\00\02\00\11\6C ;ウォームスタート
Cmd2=\B5\62\06\04\04\00\FF\FF\02\00\0E\61 ;コールドスタート
Cmd3=\B5\62\6\1\3\0\2\10\1\1D\66|\B5\62\6\1\3\0\2\11\1\1E\68 ;RXM-RAW & RXM-SFRB on (rtkconv用)
Cmd4=\B5\62\6\1\3\0\2\10\0\1C\65|\B5\62\6\1\3\0\2\11\0\1D\67 ;RXM-RAW & RXM-SFRB off
Cmd5=\B5\62\06\01\03\00\02\10\01\1D\66 ;RXM-RAW     Raw Measurement Data
Cmd6=\B5\62\06\01\03\00\02\10\00\1C\65 ;RXM-RAW     Off
Cmd7=\B5\62\06\01\03\00\02\11\01\1E\68 ;RXM-SFRB    Subframe Buffer
Cmd8=\B5\62\06\01\03\00\02\11\00\1D\67 ;RXM-SFRB    Off
Cmd9=\B5\62\06\01\03\00\02\20\01\2D\86 ;RXM-SVSI    SV Status Info
Cmd10=\B5\62\06\01\03\00\02\20\00\2C\85 ;RXM-SVSI    Off
Cmd11=\B5\62\06\01\03\00\01\21\01\2D\85 ;NAV-TIMEUTC UTC Time Solution
Cmd12=\B5\62\06\01\03\00\01\21\00\2C\84 ;NAV-TIMEUTC Off
Cmd13=\B5\62\06\01\03\00\01\02\01\0E\47 ;NAV-POSLLH  Geodetic Position Solution
Cmd14=\B5\62\06\01\03\00\01\02\00\0D\46 ;NAV-POSLLH  Off
Cmd15=\B5\62\06\01\03\00\01\04\01\10\4B ;NAV-DOP     Dilution of precision
Cmd16=\B5\62\06\01\03\00\01\04\00\0F\4A ;NAV-DOP     Off
Cmd17=\B5\62\06\01\03\00\01\06\01\12\4F ;NAV-SOL     Navigation Solution Information
Cmd18=\B5\62\06\01\03\00\01\06\00\11\4E ;NAV-SOL     Off
Cmd19=\B5\62\06\16\08\00\01\03\03\00\51\AA\06\00\2C\07 ;SBAS設定: PRN=120,124,126,129,131,133,135,137,138
Cmd20=\B5\62\06\16\00\00\1C\5A                         ;SBAS設定の問合せ
Cmd21=\B5\62\6\24\24\0\1\0\0\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\4F\87 ;ポータブル (<=1116km/h)
Cmd22=\B5\62\6\24\24\0\1\0\2\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\51\CB ;静止       (<=  36km/h)
Cmd23=\B5\62\6\24\24\0\1\0\3\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\52\ED ;歩行       (<= 108km/h)
Cmd24=\B5\62\6\24\24\0\1\0\4\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\53\0F ;自動車     (<= 302km/h)
Cmd25=\B5\62\6\24\24\0\1\0\5\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\54\31 ;海上       (<=  90km/h)
Cmd26=\B5\62\6\24\24\0\1\0\6\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\55\53 ;飛行機 <1g (<= 360km/h)
Cmd27=\B5\62\6\24\24\0\1\0\7\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\56\75 ;飛行機 <2g (<= 900km/h)
Cmd28=\B5\62\6\24\24\0\1\0\8\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\57\97 ;飛行機 <4g (<=1800km/h)
Cmd29=\B5\62\06\24\00\00\2A\84 ;Get navigation engine settings
Cmd30=\B5\62\06\09\0C\00\00\00\00\00\FF\07\00\00\00\00\00\00\21\B8 ;設定を不揮発性メモリーに保存する
Cmd31=\B5\62\06\09\0C\00\00\00\00\00\00\00\00\00\FF\07\00\00\21\A0 ;不揮発性メモリーから設定をロードする
Cmd32=\B5\62\06\09\0C\00\FF\07\00\00\00\00\00\00\00\00\00\00\21\D0 ;不揮発性メモリーを工場出荷時初期値に戻す
Cmd33=\B5\62\6\9\C\0\FF\7\0\0\0\0\0\0\0\0\0\0|\B5\62\6\9\C\0\0\0\0\0\0\0\0\0\FF\7\0\0 ;不揮発性メモリーを工場出荷時初期値に戻してロードする
Cmd34=\B5\62\06\08\06\00\C8\00\01\00\01\00\DE\6A ;NMEAを 200mS周期で出力(5Hz) >=115,200bps
Cmd35=\B5\62\06\08\06\00\F4\01\01\00\01\00\0B\77 ;NMEAを 500mS周期で出力(2Hz) >=115,200bps
Cmd36=\B5\62\06\08\06\00\E8\03\01\00\01\00\01\39 ;NMEAを1000mS周期で出力(1Hz)
Cmd37=\B5\62\06\08\06\00\D0\07\01\00\01\00\ED\BD ;NMEAを2000mS周期で出力(0.5Hz)
Cmd38=\B5\62\06\08\06\00\88\13\01\00\01\00\B1\49 ;NMEAを5000mS周期で出力(0.2Hz)
Cmd39=$EIGPQ,GBS ;Query GNSS Satellite Fault Detection
Cmd40=$EIGPQ,GRS ;Query GNSS Range Residuals
Cmd41=$EIGPQ,DTM ;Query Datum Reference
Cmd42=$PUBX,41,1,0007,0003,460800,0 ;RS-232Cボーレートを 460,800bpsに設定  \B460800\
Cmd43=$PUBX,41,1,0007,0003,230400,0 ;RS-232Cボーレートを 230,400bpsに設定  \B230400\
Cmd44=$PUBX,41,1,0007,0003,115200,0 ;RS-232Cボーレートを 115,200bpsに設定  \B115200\
Cmd45=$PUBX,41,1,0007,0003,9600,0   ;RS-232Cボーレートを   9,600bpsに設定  \B9600\
Cmd46=$PUBX,41,1,0007,0003,4800,0   ;RS-232Cボーレートを   4,800bpsに設定  \B4800\
Cmd47=\B5\62\A\4\0\0\0E\34 ;Query Receiver/Software Version

[GpsCmd LEA-M8F]
Cmd0=; RAWコマンドは非公認（無効になる可能性有り）
Cmd1=\B5\62\06\04\04\00\00\00\02\00\10\68 ;ホットスタート
Cmd2=\B5\62\06\04\04\00\01\00\02\00\11\6C ;ウォームスタート
Cmd3=\B5\62\06\04\04\00\FF\FF\02\00\0E\61 ;コールドスタート
Cmd4=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\0\0\1\0\00\E6 ;GPS only
Cmd5=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\1\0\1\0\01\EA|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+GLONASS
Cmd6=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\1\0\1\0\6\10\10\0\0\0\1\0\01\F2|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+BeiDou
Cmd7=\B5\62\6\1\8\0\3\10\0\0\0\1\0\0\23\2E|\B5\62\6\1\8\0\3\F\0\0\0\1\0\0\22\27|\B5\62\6\1\8\0\1\20\0\0\0\1\0\0\31\8E ;RAW on (for rtkconv)
Cmd8=\B5\62\6\1\8\0\3\10\0\0\0\0\0\0\22\2B|\B5\62\6\1\8\0\3\F\0\0\0\0\0\0\21\24|\B5\62\6\1\8\0\1\20\0\0\0\0\0\0\30\8B ;RAW off
Cmd9=\B5\62\06\01\03\00\02\20\01\2D\86 ;RXM-SVSI    SV Status Info
Cmd10=\B5\62\06\01\03\00\02\20\00\2C\85 ;RXM-SVSI    Off
Cmd11=\B5\62\06\01\03\00\01\21\01\2D\85 ;NAV-TIMEUTC UTC Time Solution
Cmd12=\B5\62\06\01\03\00\01\21\00\2C\84 ;NAV-TIMEUTC Off
Cmd13=\B5\62\06\01\03\00\01\02\01\0E\47 ;NAV-POSLLH  Geodetic Position Solution
Cmd14=\B5\62\06\01\03\00\01\02\00\0D\46 ;NAV-POSLLH  Off
Cmd15=\B5\62\06\01\03\00\01\04\01\10\4B ;NAV-DOP     Dilution of precision
Cmd16=\B5\62\06\01\03\00\01\04\00\0F\4A ;NAV-DOP     Off
Cmd17=\B5\62\06\01\03\00\01\06\01\12\4F ;NAV-SOL     Navigation Solution Information
Cmd18=\B5\62\06\01\03\00\01\06\00\11\4E ;NAV-SOL     Off
Cmd19=\B5\62\06\16\08\00\01\03\03\00\51\AA\06\00\2C\07 ;SBAS設定: PRN=120,124,126,129,131,133,135,137,138
Cmd20=\B5\62\06\16\00\00\1C\5A                         ;SBAS設定の問合せ
Cmd21=\B5\62\6\24\24\0\1\0\0\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\4F\87 ;ポータブル (<=1116km/h)
Cmd22=\B5\62\6\24\24\0\1\0\2\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\51\CB ;静止       (<=  36km/h)
Cmd23=\B5\62\6\24\24\0\1\0\3\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\52\ED ;歩行       (<= 108km/h)
Cmd24=\B5\62\6\24\24\0\1\0\4\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\53\0F ;自動車     (<= 360km/h)
Cmd25=\B5\62\6\24\24\0\1\0\5\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\54\31 ;海上       (<=  90km/h)
Cmd26=\B5\62\6\24\24\0\1\0\6\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\55\53 ;飛行機 <1g (<= 360km/h)
Cmd27=\B5\62\6\24\24\0\1\0\7\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\56\75 ;飛行機 <2g (<= 900km/h)
Cmd28=\B5\62\6\24\24\0\1\0\8\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\57\97 ;飛行機 <4g (<=1800km/h)
Cmd29=\B5\62\06\24\00\00\2A\84 ;Get navigation engine settings
Cmd30=\B5\62\06\09\0C\00\00\00\00\00\FF\07\00\00\00\00\00\00\21\B8 ;設定を不揮発性メモリーに保存する
Cmd31=\B5\62\06\09\0C\00\00\00\00\00\00\00\00\00\FF\07\00\00\21\A0 ;不揮発性メモリーから設定をロードする
Cmd32=\B5\62\06\09\0C\00\FF\07\00\00\00\00\00\00\00\00\00\00\21\D0 ;不揮発性メモリーを工場出荷時初期値に戻す
Cmd33=\B5\62\6\9\C\0\FF\7\0\0\0\0\0\0\0\0\0\0|\B5\62\6\9\C\0\0\0\0\0\0\0\0\0\FF\7\0\0 ;不揮発性メモリーを工場出荷時初期値に戻してロードする
Cmd34=\B5\62\06\08\06\00\C8\00\01\00\01\00\DE\6A ;NMEAを 200mS周期で出力(5Hz) >=115,200bps
Cmd35=\B5\62\06\08\06\00\F4\01\01\00\01\00\0B\77 ;NMEAを 500mS周期で出力(2Hz) >=115,200bps
Cmd36=\B5\62\06\08\06\00\E8\03\01\00\01\00\01\39 ;NMEAを1000mS周期で出力(1Hz)
Cmd37=\B5\62\06\08\06\00\D0\07\01\00\01\00\ED\BD ;NMEAを2000mS周期で出力(0.5Hz)
Cmd38=\B5\62\06\08\06\00\88\13\01\00\01\00\B1\49 ;NMEAを5000mS周期で出力(0.2Hz)
Cmd39=$PUBX,41,1,0007,0003,460800,0 ;RS-232Cボーレートを 460,800bpsに設定  \B460800\
Cmd40=$PUBX,41,1,0007,0003,230400,0 ;RS-232Cボーレートを 230,400bpsに設定  \B230400\
Cmd41=$PUBX,41,1,0007,0003,115200,0 ;RS-232Cボーレートを 115,200bpsに設定  \B115200\
Cmd42=$PUBX,41,1,0007,0003,9600,0   ;RS-232Cボーレートを   9,600bpsに設定  \B9600\
Cmd43=$PUBX,41,1,0007,0003,4800,0   ;RS-232Cボーレートを   4,800bpsに設定  \B4800\
Cmd44=\B5\62\06\17\14\00\00\21\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\55\F7 ;NMEA 0183 V2.1
Cmd45=\B5\62\06\17\14\00\00\23\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\57\1D ;NMEA 0183 V2.3
Cmd46=\B5\62\06\17\14\00\00\40\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\74\44 ;NMEA 0183 V4.0
Cmd47=\B5\62\06\17\14\00\00\41\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\75\57 ;NMEA 0183 V4.1
Cmd48=\B5\62\A\4\0\0\0E\34 ;Query Receiver/Software Version

[GpsCmd LEA-M8T]
Cmd0=\B5\62\06\04\04\00\00\00\02\00\10\68 ;ホットスタート
Cmd1=\B5\62\06\04\04\00\01\00\02\00\11\6C ;ウォームスタート
Cmd2=\B5\62\06\04\04\00\FF\FF\02\00\0E\61 ;コールドスタート
Cmd3=\B5\62\6\3E\3C\0\0\0\20\7\0\8\10\0\1\0\1\0\1\1\3\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\4\0\8\0\0\0\1\0\5\0\3\0\1\0\1\0\6\10\10\0\0\0\1\0\39\12 ;GPS only
Cmd4=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\1\0\1\0\01\EA|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+GLONASS
Cmd5=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\1\0\1\0\6\10\10\0\0\0\1\0\01\F2|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+BeiDou
Cmd6=\B5\62\6\1\8\0\2\15\0\1\1\1\0\0\29\52|\B5\62\6\1\8\0\2\13\0\1\1\1\0\0\27\44 ;RXM-RAWX & RXM-SFRBX on (rtkconv用)
Cmd7=\B5\62\6\1\8\0\2\15\0\0\0\0\0\0\26\46|\B5\62\6\1\8\0\2\13\0\0\0\0\0\0\24\38 ;RXM-RAWX & RXM-SFRBX off
Cmd8=\B5\62\6\1\8\0\2\15\0\1\1\1\0\0\29\52 ;RXM-RAWX     Raw Measurement Data
Cmd9=\B5\62\6\1\8\0\2\15\0\0\0\0\0\0\26\46 ;RXM-RAWX     Off
Cmd10=\B5\62\6\1\8\0\2\13\0\1\1\1\0\0\27\44 ;RXM-SFRBX    Subframe Buffer
Cmd11=\B5\62\6\1\8\0\2\13\0\0\0\0\0\0\24\38 ;RXM-SFRBX    Off
Cmd12=\B5\62\06\01\03\00\02\20\01\2D\86 ;RXM-SVSI    SV Status Info
Cmd13=\B5\62\06\01\03\00\02\20\00\2C\85 ;RXM-SVSI    Off
Cmd14=\B5\62\06\01\03\00\01\21\01\2D\85 ;NAV-TIMEUTC UTC Time Solution
Cmd15=\B5\62\06\01\03\00\01\21\00\2C\84 ;NAV-TIMEUTC Off
Cmd16=\B5\62\06\01\03\00\01\02\01\0E\47 ;NAV-POSLLH  Geodetic Position Solution
Cmd17=\B5\62\06\01\03\00\01\02\00\0D\46 ;NAV-POSLLH  Off
Cmd18=\B5\62\06\01\03\00\01\04\01\10\4B ;NAV-DOP     Dilution of precision
Cmd19=\B5\62\06\01\03\00\01\04\00\0F\4A ;NAV-DOP     Off
Cmd20=\B5\62\06\01\03\00\01\06\01\12\4F ;NAV-SOL     Navigation Solution Information
Cmd21=\B5\62\06\01\03\00\01\06\00\11\4E ;NAV-SOL     Off
Cmd22=\B5\62\06\16\08\00\01\03\03\00\51\AA\06\00\2C\07 ;SBAS設定: PRN=120,124,126,129,131,133,135,137,138
Cmd23=\B5\62\06\16\00\00\1C\5A                         ;SBAS設定の問合せ
Cmd24=\B5\62\6\24\24\0\1\0\0\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\4F\87 ;ポータブル (<=1116km/h)
Cmd25=\B5\62\6\24\24\0\1\0\2\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\51\CB ;静止       (<=  36km/h)
Cmd26=\B5\62\6\24\24\0\1\0\3\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\52\ED ;歩行       (<= 108km/h)
Cmd27=\B5\62\6\24\24\0\1\0\4\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\53\0F ;自動車     (<= 360km/h)
Cmd28=\B5\62\6\24\24\0\1\0\5\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\54\31 ;海上       (<=  90km/h)
Cmd29=\B5\62\6\24\24\0\1\0\6\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\55\53 ;飛行機 <1g (<= 360km/h)
Cmd30=\B5\62\6\24\24\0\1\0\7\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\56\75 ;飛行機 <2g (<= 900km/h)
Cmd31=\B5\62\6\24\24\0\1\0\8\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\57\97 ;飛行機 <4g (<=1800km/h)
Cmd32=\B5\62\06\24\00\00\2A\84 ;Get navigation engine settings
Cmd33=\B5\62\06\09\0C\00\00\00\00\00\FF\07\00\00\00\00\00\00\21\B8 ;設定を不揮発性メモリーに保存する
Cmd34=\B5\62\06\09\0C\00\00\00\00\00\00\00\00\00\FF\07\00\00\21\A0 ;不揮発性メモリーから設定をロードする
Cmd35=\B5\62\06\09\0C\00\FF\07\00\00\00\00\00\00\00\00\00\00\21\D0 ;不揮発性メモリーを工場出荷時初期値に戻す
Cmd36=\B5\62\6\9\C\0\FF\7\0\0\0\0\0\0\0\0\0\0|\B5\62\6\9\C\0\0\0\0\0\0\0\0\0\FF\7\0\0 ;不揮発性メモリーを工場出荷時初期値に戻してロードする
Cmd37=\B5\62\06\08\06\00\C8\00\01\00\01\00\DE\6A ;NMEAを 200mS周期で出力(5Hz) >=115,200bps
Cmd38=\B5\62\06\08\06\00\F4\01\01\00\01\00\0B\77 ;NMEAを 500mS周期で出力(2Hz) >=115,200bps
Cmd39=\B5\62\06\08\06\00\E8\03\01\00\01\00\01\39 ;NMEAを1000mS周期で出力(1Hz)
Cmd40=\B5\62\06\08\06\00\D0\07\01\00\01\00\ED\BD ;NMEAを2000mS周期で出力(0.5Hz)
Cmd41=\B5\62\06\08\06\00\88\13\01\00\01\00\B1\49 ;NMEAを5000mS周期で出力(0.2Hz)
Cmd42=$PUBX,41,1,0007,0003,460800,0 ;RS-232Cボーレートを 460,800bpsに設定  \B460800\
Cmd43=$PUBX,41,1,0007,0003,230400,0 ;RS-232Cボーレートを 230,400bpsに設定  \B230400\
Cmd44=$PUBX,41,1,0007,0003,115200,0 ;RS-232Cボーレートを 115,200bpsに設定  \B115200\
Cmd45=$PUBX,41,1,0007,0003,9600,0   ;RS-232Cボーレートを   9,600bpsに設定  \B9600\
Cmd46=$PUBX,41,1,0007,0003,4800,0   ;RS-232Cボーレートを   4,800bpsに設定  \B4800\
Cmd47=\B5\62\06\17\14\00\00\21\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\55\F7 ;NMEA 0183 V2.1
Cmd48=\B5\62\06\17\14\00\00\23\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\57\1D ;NMEA 0183 V2.3
Cmd49=\B5\62\06\17\14\00\00\40\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\74\44 ;NMEA 0183 V4.0
Cmd50=\B5\62\06\17\14\00\00\41\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\75\57 ;NMEA 0183 V4.1
Cmd51=\B5\62\A\4\0\0\0E\34 ;Query Receiver/Software Version

[GpsCmd NEO-M8N]
Cmd0=; RAWコマンドは非公認（無効になる可能性有り）
Cmd1=\B5\62\06\04\04\00\00\00\02\00\10\68 ;ホットスタート
Cmd2=\B5\62\06\04\04\00\01\00\02\00\11\6C ;ウォームスタート
Cmd3=\B5\62\06\04\04\00\FF\FF\02\00\0E\61 ;コールドスタート
Cmd4=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\0\0\1\0\00\E6 ;GPS only
Cmd5=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\1\0\1\0\01\EA|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+GLONASS
Cmd6=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\1\0\1\0\6\10\10\0\0\0\1\0\01\F2|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+BeiDou
Cmd7=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\1\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\0\0\1\0\01\FA|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+Galileo
Cmd8=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\1\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\1\0\1\0\02\FE|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+Galileo+GLONASS
Cmd9=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\1\0\1\0\3\10\10\0\1\0\1\0\6\10\10\0\0\0\1\0\02\06|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+Galileo+BeiDou
Cmd10=\B5\62\6\1\8\0\3\10\0\0\0\1\0\0\23\2E|\B5\62\6\1\8\0\3\F\0\0\0\1\0\0\22\27|\B5\62\6\1\8\0\1\20\0\0\0\1\0\0\31\8E ;RAW on (for rtkconv)
Cmd11=\B5\62\6\1\8\0\3\10\0\0\0\0\0\0\22\2B|\B5\62\6\1\8\0\3\F\0\0\0\0\0\0\21\24|\B5\62\6\1\8\0\1\20\0\0\0\0\0\0\30\8B ;RAW off
Cmd12=\B5\62\06\01\03\00\02\20\01\2D\86 ;RXM-SVSI    SV Status Info
Cmd13=\B5\62\06\01\03\00\02\20\00\2C\85 ;RXM-SVSI    Off
Cmd14=\B5\62\06\01\03\00\01\21\01\2D\85 ;NAV-TIMEUTC UTC Time Solution
Cmd15=\B5\62\06\01\03\00\01\21\00\2C\84 ;NAV-TIMEUTC Off
Cmd16=\B5\62\06\01\03\00\01\02\01\0E\47 ;NAV-POSLLH  Geodetic Position Solution
Cmd17=\B5\62\06\01\03\00\01\02\00\0D\46 ;NAV-POSLLH  Off
Cmd18=\B5\62\06\01\03\00\01\04\01\10\4B ;NAV-DOP     Dilution of precision
Cmd19=\B5\62\06\01\03\00\01\04\00\0F\4A ;NAV-DOP     Off
Cmd20=\B5\62\06\01\03\00\01\06\01\12\4F ;NAV-SOL     Navigation Solution Information
Cmd21=\B5\62\06\01\03\00\01\06\00\11\4E ;NAV-SOL     Off
Cmd22=\B5\62\06\16\08\00\01\03\03\00\51\AA\06\00\2C\07 ;SBAS設定: PRN=120,124,126,129,131,133,135,137,138
Cmd23=\B5\62\06\16\00\00\1C\5A                         ;SBAS設定の問合せ
Cmd24=\B5\62\6\24\24\0\1\0\0\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\4F\87 ;ポータブル (<=1116km/h)
Cmd25=\B5\62\6\24\24\0\1\0\2\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\51\CB ;静止       (<=  36km/h)
Cmd26=\B5\62\6\24\24\0\1\0\3\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\52\ED ;歩行       (<= 108km/h)
Cmd27=\B5\62\6\24\24\0\1\0\4\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\53\0F ;自動車     (<= 360km/h)
Cmd28=\B5\62\6\24\24\0\1\0\5\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\54\31 ;海上       (<=  90km/h)
Cmd29=\B5\62\6\24\24\0\1\0\6\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\55\53 ;飛行機 <1g (<= 360km/h)
Cmd30=\B5\62\6\24\24\0\1\0\7\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\56\75 ;飛行機 <2g (<= 900km/h)
Cmd31=\B5\62\6\24\24\0\1\0\8\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\57\97 ;飛行機 <4g (<=1800km/h)
Cmd32=\B5\62\06\24\00\00\2A\84 ;Get navigation engine settings
Cmd33=\B5\62\06\09\0C\00\00\00\00\00\FF\07\00\00\00\00\00\00\21\B8 ;設定を不揮発性メモリーに保存する
Cmd34=\B5\62\06\09\0C\00\00\00\00\00\00\00\00\00\FF\07\00\00\21\A0 ;不揮発性メモリーから設定をロードする
Cmd35=\B5\62\06\09\0C\00\FF\07\00\00\00\00\00\00\00\00\00\00\21\D0 ;不揮発性メモリーを工場出荷時初期値に戻す
Cmd36=\B5\62\6\9\C\0\FF\7\0\0\0\0\0\0\0\0\0\0|\B5\62\6\9\C\0\0\0\0\0\0\0\0\0\FF\7\0\0 ;不揮発性メモリーを工場出荷時初期値に戻してロードする
Cmd37=\B5\62\06\08\06\00\C8\00\01\00\01\00\DE\6A ;NMEAを 200mS周期で出力(5Hz) >=115,200bps
Cmd38=\B5\62\06\08\06\00\F4\01\01\00\01\00\0B\77 ;NMEAを 500mS周期で出力(2Hz) >=115,200bps
Cmd39=\B5\62\06\08\06\00\E8\03\01\00\01\00\01\39 ;NMEAを1000mS周期で出力(1Hz)
Cmd40=\B5\62\06\08\06\00\D0\07\01\00\01\00\ED\BD ;NMEAを2000mS周期で出力(0.5Hz)
Cmd41=\B5\62\06\08\06\00\88\13\01\00\01\00\B1\49 ;NMEAを5000mS周期で出力(0.2Hz)
Cmd42=$PUBX,41,1,0007,0003,460800,0 ;RS-232Cボーレートを 460,800bpsに設定  \B460800\
Cmd43=$PUBX,41,1,0007,0003,230400,0 ;RS-232Cボーレートを 230,400bpsに設定  \B230400\
Cmd44=$PUBX,41,1,0007,0003,115200,0 ;RS-232Cボーレートを 115,200bpsに設定  \B115200\
Cmd45=$PUBX,41,1,0007,0003,9600,0   ;RS-232Cボーレートを   9,600bpsに設定  \B9600\
Cmd46=$PUBX,41,1,0007,0003,4800,0   ;RS-232Cボーレートを   4,800bpsに設定  \B4800\
Cmd47=\B5\62\06\17\14\00\00\21\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\55\F7 ;NMEA 0183 V2.1
Cmd48=\B5\62\06\17\14\00\00\23\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\57\1D ;NMEA 0183 V2.3
Cmd49=\B5\62\06\17\14\00\00\40\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\74\44 ;NMEA 0183 V4.0
Cmd50=\B5\62\06\17\14\00\00\41\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\75\57 ;NMEA 0183 V4.1
Cmd51=\B5\62\A\4\0\0\0E\34 ;Query Receiver/Software Version

[GpsCmd NEO-M8T]
Cmd0=\B5\62\06\04\04\00\00\00\02\00\10\68 ;ホットスタート
Cmd1=\B5\62\06\04\04\00\01\00\02\00\11\6C ;ウォームスタート
Cmd2=\B5\62\06\04\04\00\FF\FF\02\00\0E\61 ;コールドスタート
Cmd3=\B5\62\06\00\14\00\03\00\00\00\00\00\00\00\00\00\00\00\07\00\02\00\00\00\00\00\26\C8 ;USB   NMEA Only
Cmd4=\B5\62\06\00\14\00\03\00\00\00\00\00\00\00\00\00\00\00\07\00\01\00\00\00\00\00\25\C2 ;USB   UBX  Only
Cmd5=\B5\62\06\00\14\00\03\00\00\00\00\00\00\00\00\00\00\00\07\00\03\00\00\00\00\00\27\CE ;USB   NMEA + UBX
Cmd6=\B5\62\06\00\14\00\01\00\00\00\D0\08\00\00\00\C2\01\00\07\00\02\00\00\00\00\00\BF\78 ;UART1 NMEA Only
Cmd7=\B5\62\06\00\14\00\01\00\00\00\D0\08\00\00\00\C2\01\00\07\00\01\00\00\00\00\00\BE\72 ;UART1 UBX  Only
Cmd8=\B5\62\06\00\14\00\01\00\00\00\D0\08\00\00\00\C2\01\00\07\00\03\00\00\00\00\00\C0\7E ;UART1 NMEA + UBX
Cmd9=\B5\62\6\3E\3C\0\0\0\20\7\0\8\10\0\1\0\1\0\1\1\3\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\4\0\8\0\0\0\1\0\5\0\3\0\1\0\1\0\6\10\10\0\0\0\1\0\39\12 ;GPS only
Cmd10=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\1\0\1\0\01\EA|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+GLONASS
Cmd11=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\0\0\1\0\3\10\10\0\1\0\1\0\6\10\10\0\0\0\1\0\01\F2|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+BeiDou
Cmd12=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\1\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\0\0\1\0\01\FA|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+Galileo
Cmd13=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\1\0\1\0\3\10\10\0\0\0\1\0\6\10\10\0\1\0\1\0\02\FE|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+Galileo+GLONASS
Cmd14=\B5\62\6\3E\24\0\0\0\20\4\0\8\10\0\1\0\1\0\2\4\8\0\1\0\1\0\3\10\10\0\1\0\1\0\6\10\10\0\0\0\1\0\02\06|\B5\62\6\17\14\0\0\40\0\2\0\0\0\0\1\0\0\1\0\0\0\0\0\0\0\0\75\50 ;GPS+Galileo+BeiDou
Cmd15=\B5\62\6\1\8\0\2\15\0\1\1\1\0\0\29\52|\B5\62\6\1\8\0\2\13\0\0\0\0\0\0\24\38 ;RXM-RAWX On (rtkconv用)
Cmd16=\B5\62\6\1\8\0\2\15\0\1\1\1\0\0\29\52|\B5\62\6\1\8\0\2\13\0\1\1\1\0\0\27\44 ;RXM-RAWX & RXM-SFRBX On (rtkconv用)
Cmd17=\B5\62\6\1\8\0\2\15\0\0\0\0\0\0\26\46|\B5\62\6\1\8\0\2\13\0\0\0\0\0\0\24\38 ;RXM-RAWX & RXM-SFRBX Off
Cmd18=\B5\62\6\1\8\0\2\15\0\1\1\1\0\0\29\52 ;RXM-RAWX  Raw Measurement Data
Cmd19=\B5\62\6\1\8\0\2\15\0\0\0\0\0\0\26\46 ;RXM-RAWX  Off
Cmd20=\B5\62\6\1\8\0\2\13\0\1\1\1\0\0\27\44 ;RXM-SFRBX Subframe Buffer
Cmd21=\B5\62\6\1\8\0\2\13\0\0\0\0\0\0\24\38 ;RXM-SFRBX Off
Cmd22=\B5\62\06\01\03\00\02\20\01\2D\86 ;RXM-SVSI    SV Status Info
Cmd23=\B5\62\06\01\03\00\02\20\00\2C\85 ;RXM-SVSI    Off
Cmd24=\B5\62\06\01\03\00\01\21\01\2D\85 ;NAV-TIMEUTC UTC Time Solution
Cmd25=\B5\62\06\01\03\00\01\21\00\2C\84 ;NAV-TIMEUTC Off
Cmd26=\B5\62\06\01\03\00\01\02\01\0E\47 ;NAV-POSLLH  Geodetic Position Solution
Cmd27=\B5\62\06\01\03\00\01\02\00\0D\46 ;NAV-POSLLH  Off
Cmd28=\B5\62\06\01\03\00\01\04\01\10\4B ;NAV-DOP     Dilution of precision
Cmd29=\B5\62\06\01\03\00\01\04\00\0F\4A ;NAV-DOP     Off
Cmd30=\B5\62\06\01\03\00\01\06\01\12\4F ;NAV-SOL     Navigation Solution Information
Cmd31=\B5\62\06\01\03\00\01\06\00\11\4E ;NAV-SOL     Off
Cmd32=\B5\62\06\16\08\00\01\03\03\00\51\AA\06\00\2C\07 ;SBAS設定: PRN=120,124,126,129,131,133,135,137,138
Cmd33=\B5\62\06\16\00\00\1C\5A                         ;SBAS設定の問合せ
Cmd34=\B5\62\6\24\24\0\1\0\0\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\4F\87 ;ポータブル (<=1116km/h)
Cmd35=\B5\62\6\24\24\0\1\0\2\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\51\CB ;静止       (<=  36km/h)
Cmd36=\B5\62\6\24\24\0\1\0\3\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\52\ED ;歩行       (<= 108km/h)
Cmd37=\B5\62\6\24\24\0\1\0\4\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\53\0F ;自動車     (<= 360km/h)
Cmd38=\B5\62\6\24\24\0\1\0\5\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\54\31 ;海上       (<=  90km/h)
Cmd39=\B5\62\6\24\24\0\1\0\6\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\55\53 ;飛行機 <1g (<= 360km/h)
Cmd40=\B5\62\6\24\24\0\1\0\7\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\56\75 ;飛行機 <2g (<= 900km/h)
Cmd41=\B5\62\6\24\24\0\1\0\8\3\0\0\0\0\10\27\0\0\5\0\FA\0\FA\0\64\0\2C\1\0\3C\0\0\0\0\0\0\0\0\0\0\0\0\57\97 ;飛行機 <4g (<=1800km/h)
Cmd42=\B5\62\06\24\00\00\2A\84 ;Get navigation engine settings
Cmd43=\B5\62\06\09\0C\00\00\00\00\00\FF\07\00\00\00\00\00\00\21\B8 ;設定を不揮発性メモリーに保存する
Cmd44=\B5\62\06\09\0C\00\00\00\00\00\00\00\00\00\FF\07\00\00\21\A0 ;不揮発性メモリーから設定をロードする
Cmd45=\B5\62\06\09\0C\00\FF\07\00\00\00\00\00\00\00\00\00\00\21\D0 ;不揮発性メモリーを工場出荷時初期値に戻す
Cmd46=\B5\62\6\9\C\0\FF\7\0\0\0\0\0\0\0\0\0\0|\B5\62\6\9\C\0\0\0\0\0\0\0\0\0\FF\7\0\0 ;不揮発性メモリーを工場出荷時初期値に戻してロードする
Cmd47=\B5\62\06\08\06\00\C8\00\01\00\01\00\DE\6A ;NMEAを 200mS周期で出力(5Hz) >=115,200bps
Cmd48=\B5\62\06\08\06\00\F4\01\01\00\01\00\0B\77 ;NMEAを 500mS周期で出力(2Hz) >=115,200bps
Cmd49=\B5\62\06\08\06\00\E8\03\01\00\01\00\01\39 ;NMEAを1000mS周期で出力(1Hz)
Cmd50=\B5\62\06\08\06\00\D0\07\01\00\01\00\ED\BD ;NMEAを2000mS周期で出力(0.5Hz)
Cmd51=\B5\62\06\08\06\00\88\13\01\00\01\00\B1\49 ;NMEAを5000mS周期で出力(0.2Hz)
Cmd52=$PUBX,41,1,0007,0003,460800,0 ;RS-232Cボーレートを 460,800bpsに設定  \B460800\
Cmd53=$PUBX,41,1,0007,0003,230400,0 ;RS-232Cボーレートを 230,400bpsに設定  \B230400\
Cmd54=$PUBX,41,1,0007,0003,115200,0 ;RS-232Cボーレートを 115,200bpsに設定  \B115200\
Cmd55=$PUBX,41,1,0007,0003,9600,0   ;RS-232Cボーレートを   9,600bpsに設定  \B9600\
Cmd56=$PUBX,41,1,0007,0003,4800,0   ;RS-232Cボーレートを   4,800bpsに設定  \B4800\
Cmd57=\B5\62\06\17\14\00\00\21\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\55\F7 ;NMEA 0183 V2.1
Cmd58=\B5\62\06\17\14\00\00\23\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\57\1D ;NMEA 0183 V2.3
Cmd59=\B5\62\06\17\14\00\00\40\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\74\44 ;NMEA 0183 V4.0
Cmd60=\B5\62\06\17\14\00\00\41\00\02\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\75\57 ;NMEA 0183 V4.1
Cmd61=\B5\62\A\4\0\0\0E\34 ;Query Receiver/Software Version

[GpsCmd M-241 Plus]
Cmd0=$PHLX810 ;製品名の問合せ
Cmd1=$PHLX829 ;ファームウェアバージョン問合せ
Cmd2=$PMTK605 ;リリース情報問合せ
Cmd3=$PMTK101 ;ホットスタート
Cmd4=$PMTK102 ;ウォームスタート
Cmd5=$PMTK103 ;コールドスタート
Cmd6=$PMTK104 ;コールドスタート (工場初期値にリセット)
Cmd7=$PMTK414 ;NMEA出力周期問合せ
Cmd8=$PMTK300,400,0,0,0,0 ;NMEAセンテンスを2000mS周期で出力(0.5Hz)
Cmd9=$PMTK300,200,0,0,0,0 ;NMEAセンテンスを1000mS周期で出力(1Hz)
Cmd10=$PMTK300,100,0,0,0,0 ;NMEAセンテンスを 500mS周期で出力(2Hz)
Cmd11=$PMTK401 ;DGPSモード問合せ (0:No DGPS, 1:RTCM, 2:WAAS)
Cmd12=$PMTK413 ;SBAS有効問合せ (0:Disable, 1:Enable)
Cmd13=$PMTK301,0 ;DGPSソース無し
Cmd14=$PMTK301,1 ;DGPSソースをRTCMに設定する
Cmd15=$PMTK301,2 ;DGPSソースをWAASに設定する
Cmd16=$PMTK313,0 ;SBAS を無効にする
Cmd17=$PMTK313,1 ;SBAS を有効にする
Cmd18=$PMTK447     ;ナビゲーション閾値を問い合わせる (m/s)
Cmd19=$PMTK386,0   ;スタティックナビゲーションをOFFにする (電源OFFまたは一部のコマンドによって1.0m/sに復帰する)
Cmd20=$PMTK386,0.6 ;スタティックナビゲーションの閾値を0.6m/sにセットする (0, 0.2, 0.4, 0.6, 0.8, 1.0, 1.5, 2.0 m/s)
Cmd21=$PHLX701 ;トラック数問合せ
Cmd22=$PHLX833 ;ログ記録モード問合せ (0/1=時間/距離, 時間間隔s, 移動距離m)
Cmd23=$PHLX834,0,5,50 ;ログ記録条件設定 (時間間隔, 5秒, (50m))
Cmd24=$PHLX834,1,5,50 ;ログ記録条件設定 (移動距離, (5秒), 50m)
Cmd25=$PHLX842,0 ;ログモード問合せ (0:上書き/1:停止)
Cmd26=$PHLX842,1,GR260,1|$PMTK101 ;フルログで停止するモードに設定する
Cmd27=$PHLX842,1,GR260,0|$PMTK101 ;フルログで上書するモードに設定する
Cmd28=$PHLX839 ;\\ログデータを削除します\\
Cmd29=$PHLX826 ;NMEAセンテンス停止 USBアイコン表示
Cmd30=$PHLX827 ;NMEAセンテンス出力開始
Cmd31=$PMTK251,38400 ;RS-232Cボーレートを 38,400bpsに設定する \B38400\

[GpsCmd ZED-F9P]
Cmd0=\B5\62\0A\04\00\00\0E\34  ;Query Receiver/Software Version
Cmd1=\B5\62\06\04\04\00\00\00\02\00\10\68 ;ホットスタート
Cmd2=\B5\62\06\04\04\00\01\00\02\00\11\6C ;ウォームスタート
Cmd3=\B5\62\06\04\04\00\FF\B9\02\00\C8\8F ;コールドスタート
Cmd4=\B5\62\06\01\03\00\02\15\01\22\70|\B5\62\06\01\03\00\02\13\01\20\6C ;RXM-RAWX & RXM-SFRBX On (rtkconv用)
Cmd5=\B5\62\06\01\03\00\02\15\00\21\6F|\B5\62\06\01\03\00\02\13\00\1F\6B ;RXM-RAWX & RXM-SFRBX Off
Cmd6=\B5\62\06\17\14\00\00\41\00\08\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\7B\BD ;NMEA緯度経度の小数点以下を７桁にする(NMEA 0183 V4.1)
Cmd7=\B5\62\06\17\14\00\00\41\00\00\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00\00\73\35 ;NMEA緯度経度の小数点以下を５桁にする(NMEA 0183 V4.1)
Cmd8=\B5\62\06\08\06\00\C8\00\01\00\00\00\DD\68 ;NMEAを 200mS周期で出力(5Hz) >=115,200bps
Cmd9=\B5\62\06\08\06\00\F4\01\01\00\00\00\0A\75 ;NMEAを 500mS周期で出力(2Hz)
Cmd10=\B5\62\06\08\06\00\E8\03\01\00\00\00\00\37 ;NMEAを1000mS周期で出力(1Hz)
Cmd11=\B5\62\06\00\14\00\01\00\00\00\D0\08\00\00\00\96\00\00\23\00\23\00\00\00\00\00\CF\30 ;URT1  38400bps \B38400\
Cmd12=\B5\62\06\00\14\00\01\00\00\00\D0\08\00\00\00\C2\01\00\23\00\23\00\00\00\00\00\FC\1E ;URT1 115200bps \B115200\
Cmd13=\B5\62\06\00\14\00\01\00\00\00\D0\08\00\00\00\84\03\00\23\00\23\00\00\00\00\00\C0\88 ;URT1 230400bps \B230400\
Cmd14=\B5\62\06\00\14\00\02\00\00\00\D0\08\00\00\00\96\00\00\20\00\20\00\00\00\00\00\CA\1A ;URT2  38400bps \B38400\
Cmd15=\B5\62\06\00\14\00\02\00\00\00\D0\08\00\00\00\C2\01\00\20\00\20\00\00\00\00\00\F7\08 ;URT2 115200bps \B115200\
Cmd16=\B5\62\06\00\14\00\02\00\00\00\D0\08\00\00\00\96\00\00\20\00\20\00\00\00\00\00\CA\1A ;URT2 230400bps \B230400\
Cmd17=\B5\62\06\09\0D\00\FF\FF\00\00\00\00\00\00\FF\FF\00\00\03\1B\9A ;不揮発性メモリーを工場出荷時初期値に戻す
Cmd18=\B5\62\06\09\0D\00\00\00\00\00\00\00\00\00\FF\FF\00\00\03\1D\B3 ;不揮発性メモリーから設定をロードする
Cmd19=\B5\62\06\09\0D\00\00\00\00\00\FF\FF\00\00\00\00\00\00\03\1D\AB ;設定を不揮発性メモリーに保存する
Cmd20=\B5\62\06\31\20\00\00\01\00\00\32\00\00\00\40\42\0F\00\40\42\0F\00\00\00\00\00\A0\86\01\00\00\00\00\00\77\00\00\00\4A\B6 ;Time pulse TP5: 1000000uS
Cmd21=\B5\62\06\31\20\00\00\01\00\00\32\00\00\00\40\42\0F\00\40\42\0F\00\00\00\00\00\A0\86\01\00\00\00\00\00\76\00\00\00\49\B2 ;Time pulse TP5: Off
Cmd22=\B5\62\06\01\08\00\01\07\01\00\00\00\00\00\18\E2|\B5\62\06\01\08\00\01\20\01\00\00\00\00\00\31\91|\B5\62\06\01\08\00\02\13\01\00\00\00\00\00\25\3E ;NAV-PVT,NAV-TIMEGPS,RXM-SFRBX On (I2C)
Cmd23=\B5\62\06\01\08\00\01\07\00\01\01\00\00\00\19\E5|\B5\62\06\01\08\00\01\20\00\01\01\00\00\00\32\94|\B5\62\06\01\08\00\02\13\00\01\01\00\00\00\26\41 ;NAV-PVT,NAV-TIMEGPS,RXM-SFRBX On (UART1,2)
Cmd24=\B5\62\06\01\08\00\01\07\00\00\00\01\00\00\18\DF|\B5\62\06\01\08\00\01\20\00\00\00\01\00\00\31\8E|\B5\62\06\01\08\00\02\13\00\00\00\01\00\00\25\3B ;NAV-PVT,NAV-TIMEGPS,RXM-SFRBX On (USB)
Cmd25=\B5\62\06\01\08\00\01\07\00\00\00\00\01\00\18\DE|\B5\62\06\01\08\00\01\20\00\00\00\00\01\00\31\8D|\B5\62\06\01\08\00\02\13\00\00\00\00\01\00\25\3A ;NAV-PVT,NAV-TIMEGPS,RXM-SFRBX On (SPI)
Cmd26=\B5\62\06\01\08\00\01\07\00\00\00\00\00\00\17\DC|\B5\62\06\01\08\00\01\20\00\00\00\00\00\00\30\8B|\B5\62\06\01\08\00\02\13\00\00\00\00\00\00\24\38 ;NAV-PVT,NAV-TIMEGPS,RXM-SFRBX Off
Cmd27=\B5\62\06\8A\09\00\00\01\00\00\07\00\93\20\01\55\4E ;CFG-NMEA-SVNUMBERRING = true  (Exteded - QZSSを出力する)
Cmd28=\B5\62\06\8A\09\00\00\01\00\00\07\00\93\20\00\54\4D ;CFG-NMEA-SVNUMBERRING = false (Strict  - QZSSを出力しない)
Cmd29=\B5\62\06\8A\09\00\00\01\00\00\14\00\31\10\01\F0\49 ;CFG-SIGNAL-QZSS_L1S_ENA = true
Cmd30=\B5\62\06\8A\09\00\00\01\00\00\14\00\31\10\00\EF\48 ;CFG-SIGNAL-QZSS_L1S_ENA = false
Cmd31=\B5\62\06\8A\09\00\00\01\00\00\05\00\37\10\01\E7\10 ;CFG-QZSS-USE_SLAS_DGNSS = true
Cmd32=\B5\62\06\8A\09\00\00\01\00\00\05\00\37\10\00\E6\0F ;CFG-QZSS-USE_SLAS_DGNSS = false

[GpsCmd NEO-D9C]
Cmd1=\B5\62\0A\04\00\00\0E\34 ;Query Software Version
Cmd2=\B5\62\06\04\04\00\00\00\02\00\10\68 ;Hot start
Cmd3=\B5\62\06\04\04\00\01\00\02\00\11\6C ;Warm start
Cmd4=\B5\62\06\04\04\00\FF\B9\02\00\C8\8F ;Cold start
Cmd5=\B5\62\06\09\0D\00\FF\FF\00\00\00\00\00\00\FF\FF\00\00\03\1B\9A ;Default configuration

[GpsCmd P-7 Pro]
Cmd0=;コマンドは拡張COMポートに対してのみ有効
Cmd1=$PQHOT*52  ;ホットスタート
Cmd2=$PQWARM*08 ;ウォームスタート
Cmd3=$PQCOLD*05 ;コールドスタート
Cmd4=$PQVERNO*41 ;ファームウェアバージョン問合せ
Cmd5=$PQSRR*52 ;システムリセット（ファームウェアリブート）
Cmd6=$PQSETFIXRATE,1*0B|$PQHOT*52 ;NMEA出力周期を1Hzに設定する
Cmd7=$PQSETFIXRATE,5*0F|$PQHOT*52 ;NMEA出力周期を5Hzに設定する
Cmd8=$PQCFGCLAMPING,1,0*51|$PQHOT*52 ;クランピング機能を無効にする
Cmd9=$PQCFGCLAMPING,1,1*50|$PQHOT*52 ;クランピング機能を有効にする
Cmd10=$PQSAVEPAR*43 ;GNSSコマンドの設定をNVMに保存する
Cmd11=$PQRESTOREPAR*0A ;すべての構成をデフォルト値に復元
Cmd12=$PQCFGNMEAMSG,1,1,1,1,1,1,1*00 ;NMEAメッセージの出力項目を設定 (GGA,RMC,GSV,GSA,GLL,VTG)
Cmd13=$PQSETBAUD,57600*49 ;NMEA 57600 Baud \B57600\
Cmd14=$PQSETBAUD,115200*7A ;NMEA 115200 Baud \B115200\

